In [1]:
import pandas as pd
metadata=pd.read_csv(r'C:\IMDB-Movie-Data.csv')

In [2]:
metadata.describe()

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [3]:
metadata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
Rank                  1000 non-null int64
Title                 1000 non-null object
Genre                 1000 non-null object
Description           1000 non-null object
Director              1000 non-null object
Actors                1000 non-null object
Year                  1000 non-null int64
Runtime (Minutes)     1000 non-null int64
Rating                1000 non-null float64
Votes                 1000 non-null int64
Revenue (Millions)    872 non-null float64
Metascore             936 non-null float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [4]:
metadata.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [5]:
C=metadata['Rating'].mean()
print(C)

6.723199999999999

In [6]:
m=metadata['Votes'].quantile(0.9)
print(m)

406251.10000000003

In [7]:
q_movie=metadata.copy().loc[metadata['Votes']>=m]
q_movie.shape

(100, 12)

In [8]:
def WR(x,m=m,C=C):
    v=x['Votes']
    R=x['Rating']
    return (v/(v+m)+R)+(m/(m+v)+C)

In [9]:
metadata['score']=metadata.apply(WR,axis=1)

In [10]:
metadata['score']

0      15.8232
1      14.7232
2      15.0232
3      14.9232
4      13.9232
        ...
995    13.9232
996    13.2232
997    13.9232
998    13.3232
999    13.0232
Name: score, Length: 1000, dtype: float64

In [11]:
col=['Title','Rating','Votes','score']
rs_orginal=metadata.sort_values('Rating',ascending=False)[col]
rs_new=metadata.sort_values('score',ascending=False)[col]

In [12]:
rs_orginal.head()

               Title  Rating    Votes    score
54   The Dark Knight     9.0  1791916  16.7232
80         Inception     8.8  1583625  16.5232
117           Dangal     8.8    48969  16.5232
36      Interstellar     8.6  1047747  16.3232
96     Kimi no na wa     8.6    34110  16.3232

In [13]:
metadata['Description'].head()

0    A group of intergalactic criminals are forced ...
1    Following clues to the origin of mankind, a te...
2    Three girls are kidnapped by a man with a diag...
3    In a city of humanoid animals, a hustling thea...
4    A secret government agency recruits some of th...
Name: Description, dtype: object

In [14]:
from sklearn.feature_extraction.text import TfidfVectorizer

In [15]:
tfidf=TfidfVectorizer(stop_words='english') 
#tf=특징이 얼마나 많은지/idf=다른문장과 비교했을때 다른게 얼마나 많은지(특징이 얼마나 고유한지)
metadata.Description=metadata.Description.fillna('')

In [16]:
tfidf_matrix=tfidf.fit_transform(metadata.Description)
print(tfidf_matrix)

  (0, 2246)	0.21774339622092687
  (0, 2649)	0.33971922781539177
  (0, 1229)	0.33971922781539177
  (0, 2020)	0.24877251686207938
  (0, 5613)	0.2623257870529036
  (0, 4777)	0.2551245011753801
  (0, 1888)	0.3891343606726167
  (0, 5493)	0.2971980892080351
  (0, 4937)	0.3023381228609386
  (0, 1148)	0.3023381228609386
  (0, 5314)	0.3215734366412338
  (1, 2012)	0.29449256448245537
  (1, 1005)	0.30745060337197083
  (1, 3568)	0.37204439281792756
  (1, 3120)	0.3153987761756993
  (1, 4971)	0.22022599122103517
  (1, 1968)	0.20405347429299328
  (1, 4812)	0.37204439281792756
  (1, 1503)	0.3247994693213087
  (1, 3327)	0.3247994693213087
  (1, 4660)	0.24611438520757062
  (1, 4069)	0.2841457702551132
  (2, 2173)	0.24286460105433
  (2, 2825)	0.23873567344604288
  (2, 3108)	0.14914739073502162
  :	:
  (997, 4292)	0.30142341499115827
  (997, 4821)	0.28339339973665945
  (997, 1458)	0.2946733668397855
  (997, 1284)	0.3184321779056564
  (997, 4677)	0.3184321779056564
  (997, 3503)	0.3647509231777795
  (997, 455)	0.3647509231777795
  (997, 3154)	0.3647509231777795
  (998, 3286)	0.2835268887898345
  (998, 2083)	0.24324317481640564
  (998, 5598)	0.23144884822018505
  (998, 2192)	0.35829101603542196
  (998, 1668)	0.35829101603542196
  (998, 4214)	0.35829101603542196
  (998, 3620)	0.33336964028689287
  (998, 3622)	0.40089438927354487
  (998, 3146)	0.3871791664912207
  (999, 1968)	0.2432236351844627
  (999, 1885)	0.22857119457205693
  (999, 642)	0.3445481136103629
  (999, 769)	0.40086218557935976
  (999, 852)	0.3664689055203943
  (999, 2618)	0.3582622346540447
  (999, 5166)	0.38714806453567796
  (999, 4824)	0.4434621365046748

In [17]:
tfidf_matrix.shape

(1000, 5667)

In [18]:
from sklearn.metrics.pairwise import linear_kernel
cosine_sim=linear_kernel(tfidf_matrix,tfidf_matrix)

In [21]:
cosine_sim[0].shape

(1000,)

In [34]:
indices=pd.Series(metadata.index,index=metadata['Title']).drop_duplicates()

In [36]:
def rs(title,n=10,sim=cosine_sim):
    idx=indices[title]
    sim_score=list(enumerate(cosine_sim[idx]))
    sim_score=sorted(sim_score,key=lambda x:x[1],reverse=True)
    sim_score=sim_score[1:(n+1)]
    movie_index=[i[0] for i in sim_score]
    return metadata.Title.iloc[movie_index]

In [37]:
rs('The Dark Knight Rises')

54              The Dark Knight
144            Django Unchained
522                      Viking
471            Marie Antoinette
254               The Conjuring
920                   Centurion
253    The Amazing Spider-Man 2
604       The Rise of the Krays
615                Bastille Day
915                     Goksung
Name: Title, dtype: object

In [49]:
a=pd.DataFrame([[[1,0,0],[0,0,1],[1,0,0]]])
b=pd.DataFrame([[[0,1,0],[1,0,0],[1,0,0]]])

In [50]:
a

           0          1          2
0  [1, 0, 0]  [0, 0, 1]  [1, 0, 0]

In [52]:
q=pd.concat([a,b])

In [54]:
q

           0          1          2
0  [1, 0, 0]  [0, 0, 1]  [1, 0, 0]
0  [0, 1, 0]  [1, 0, 0]  [1, 0, 0]

In [53]:
a.corr()

Empty DataFrame
Columns: []
Index: []

In [28]:
df.corr()

Empty DataFrame
Columns: []
Index: []

In [43]:
a=pd.DataFrame([[10,20,10]])
b=pd.DataFrame([[2,3,4]])
c=pd.DataFrame([[3,4,2]])

In [44]:
a

    0   1   2
0  10  20  10

In [45]:
b

   0  1  2
0  2  3  4

In [47]:
q=pd.concat([a,b,c])

In [48]:
q.corr()

          0         1         2
0  1.000000  0.998046  0.936766
1  0.998046  1.000000  0.956802
2  0.936766  0.956802  1.000000

In [37]:
df=pd.DataFrame([[a,b,c,]])
df.corr()

Empty DataFrame
Columns: []
Index: []

In [38]:
df

              0          1          2
0  [10, 20, 10]  [2, 3, 4]  [3, 4, 2]